src/cfe/InformationRegisters/кбп_ОчередьОповещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кбп_ОчередьОповещений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_СобытияПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоHTML</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Процессы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Задачи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючДедупликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_СтатусыОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Попыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправитьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/кбп_УведомленияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кбп_УведомленияПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Процессы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Задачи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/кбп_ПодпискиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>кбп_ПодпискиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Каналы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособГруппировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_СпособыГруппировкиОповещений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнтервалМинут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_СобытияПроцессов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/кбп_ОповещенияШагов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>кбп_ОповещенияШагов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПолучателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_ВидыПолучателейОповещений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ОбработчикиПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Каналы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срочное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ВерсииСхем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_СобытияПроцессов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/Enums/кбп_СобытияПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_СобытияПроцессов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗадачаНазначена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокИстекает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачаПросрочена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачаВыполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНаДоработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НовыйКомментарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упоминание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцессЗапущен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцессЗавершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцессПрерван</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамещениеНачалось</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамещениеЗакончилось</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобытиеШага</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дайджест</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводкаЗадач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОПросрочках</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_ВидыПолучателейОповещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_ВидыПолучателейОповещений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наблюдатели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Роль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзРеквизита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_СтатусыОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>кбп_СтатусыОчереди</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетГруппировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_СпособыГруппировкиОповещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>кбп_СпособыГруппировкиОповещений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сразу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазВNМинут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазВДень</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/CommonModules/кбп_Оповещения/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Оповещение о событии задачи (ФТ-601): по настройкам шага и процесса (кбп_ОповещенияШагов)
// и стандартным получателям. Отправка — после фиксации транзакции (АР-7).
//
// Параметры:
//  Задача - СправочникСсылка.кбп_Задачи
//  Событие - ПеречислениеСсылка.кбп_СобытияПроцессов
//  Контекст - Структура, Неопределено - контекст операции движка (для условий и переменных в шаблоне).
//
Процедура ОповеститьОЗадаче(Задача, Событие, Контекст = Неопределено) Экспорт
	Оповестить(Событие, Задача.Процесс, Задача, Задача.Шаг, Контекст);
КонецПроцедуры

// Оповещение о событии процесса: запуск, завершение, прерывание.
//
// Параметры:
//  Процесс - СправочникСсылка.кбп_Процессы
//  Событие - ПеречислениеСсылка.кбп_СобытияПроцессов
//  Контекст - Структура, Неопределено
//
Процедура ОповеститьОПроцессе(Процесс, Событие, Контекст = Неопределено) Экспорт
	Оповестить(Событие, Процесс, Неопределено, Неопределено, Контекст);
КонецПроцедуры

// Шаг «Оповещение»: сообщение по шаблону шага получателям с вкладки «Оповещения» (по умолчанию — автору процесса).
//
// Параметры:
//  Контекст - Структура - контекст операции движка.
//  Шаг - СправочникСсылка.кбп_ЭлементыСхем
//
// Возвращаемое значение:
//  Массив из Строка - представления получателей (для журнала процесса).
//
Функция ОповеститьНаШаге(Контекст, Шаг) Экспорт

	Событие = Перечисления.кбп_СобытияПроцессов.СобытиеШага;
	Правила = ПравилаОповещения(Контекст.Версия, Шаг, Неопределено);
	Если Правила.Количество() = 0 Тогда
		Правило = Правила.Добавить();
		Правило.ВидПолучателя = Перечисления.кбп_ВидыПолучателейОповещений.Автор;
	КонецЕсли;
	Текст = Новый Структура("Тема, Текст, ЭтоHTML", Шаг.Наименование, Шаг.Инструкция, Ложь);
	// Шаг может пройти несколько раз (цикл): номер записи журнала отличает проходы при защите от дублей.
	Итерация = XMLСтрока(Шаг) + "|" + XMLСтрока(Контекст.НомерЖурнала);
	Получатели = Новый Массив;
	Для Каждого Правило Из Правила Цикл
		Шаблон = ?(ЗначениеЗаполнено(Правило.Шаблон), Правило.Шаблон, Шаг.ШаблонОповещения);
		ОповеститьПоПравилу(Событие, Правило, Контекст.Процесс, Контекст.Задача, Контекст, Шаблон, Текст, Итерация,
			Получатели);
	КонецЦикла;
	Возврат Получатели;

КонецФункции

// Ставит в очередь оповещение о начале или окончании замещения (ФТ-601, ФТ-305):
// замещающему — всегда, замещаемому — если в документе отмечено «Уведомлять замещаемого».
//
// Параметры:
//  Замещение - ДокументСсылка.кбп_Замещение
//  Событие - ПеречислениеСсылка.кбп_СобытияПроцессов - ЗамещениеНачалось или ЗамещениеЗакончилось.
//
Процедура ОповеститьОЗамещении(Замещение, Событие) Экспорт

	Период = СтрШаблон(НСтр("ru = 'с %1 по %2'"), Формат(Замещение.ДатаНачала, "ДЛФ=D"),
		?(ЗначениеЗаполнено(Замещение.ДатаОкончания), Формат(Замещение.ДатаОкончания, "ДЛФ=D"), НСтр("ru = 'без срока'")));
	Если Событие = Перечисления.кбп_СобытияПроцессов.ЗамещениеНачалось Тогда
		Тема = СтрШаблон(НСтр("ru = 'Замещение: %1 → %2'"), Замещение.Замещаемый, Замещение.Замещающий);
		Текст = СтрШаблон(НСтр("ru = '%1 замещает %2 %3. Задачи замещаемого видны замещающему в «Моих задачах».
			|Основание: %4'"), Замещение.Замещающий, Замещение.Замещаемый, Период, Замещение.Основание);
	Иначе
		Тема = СтрШаблон(НСтр("ru = 'Замещение закончилось: %1'"), Замещение.Замещаемый);
		Текст = СтрШаблон(НСтр("ru = 'Замещение %1 пользователем %2 закончилось (%3).'"),
			Замещение.Замещаемый, Замещение.Замещающий, Период);
	КонецЕсли;
	Ссылка = кбп_АдаптерКонфигурации.ВнешняяСсылка(Замещение);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Текст = Текст + Символы.ПС + Символы.ПС + Ссылка;
	КонецЕсли;
	Получатели = Новый Массив;
	Получатели.Добавить(Замещение.Замещающий);
	Если Замещение.УведомлятьЗамещаемого Тогда
		Получатели.Добавить(Замещение.Замещаемый);
	КонецЕсли;
	Для Каждого Получатель Из Получатели Цикл
		Если ОповещениеОтключено(Получатель, Событие) Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого Канал Из КаналыПолучателя("", Получатель, Событие) Цикл
			Сообщение = НовоеСообщение(Событие, Канал);
			Сообщение.Получатель = Получатель;
			Сообщение.Тема = Тема;
			Сообщение.Текст = Текст;
			Сообщение.Ключ = СтрШаблон("%1|%2|%3|%4", XMLСтрока(Событие), XMLСтрока(Замещение), XMLСтрока(Получатель), Канал);
			ПоставитьВОчередь(Сообщение);
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

// Запускает фоновую отправку очереди, если в ней есть сообщения. Вызывается после фиксации транзакции.
Процедура ЗапуститьОтправку() Экспорт

	Если Не ЕстьКОтправке() Тогда
		Возврат;
	КонецЕсли;
	Попытка
		ФоновыеЗадания.Выполнить("кбп_Оповещения.ОтправитьОчередь", , "кбп_ОтправкаОповещений",
			НСтр("ru = 'Конструктор процессов: отправка оповещений'"));
	Исключение
		// Задание уже выполняется или фоновые задания недоступны — отправит регламентное задание.
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Конструктор процессов.Оповещения'"), УровеньЖурналаРегистрации.Предупреждение, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

// Отправляет сообщения очереди со статусом «Ожидает» и собранные дайджесты (регламентное задание и фоновая отправка).
Процедура ОтправитьОчередь() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ожидает", Перечисления.кбп_СтатусыОчереди.Ожидает);
	Запрос.УстановитьПараметр("Сейчас", ТекущаяДатаСеанса());
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 200
	|	Очередь.Ид КАК Ид
	|ИЗ
	|	РегистрСведений.кбп_ОчередьОповещений КАК Очередь
	|ГДЕ
	|	Очередь.Статус = &Ожидает
	|	И Очередь.ОтправитьПосле <= &Сейчас
	|
	|УПОРЯДОЧИТЬ ПО
	|	Очередь.ДатаСоздания";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОтправитьСообщение(Выборка.Ид);
	КонецЦикла;
	ОтправитьДайджесты();

КонецПроцедуры

// Каналы оповещений, доступные в базе (Архитектура п. 9).
//
// Возвращаемое значение:
//  СписокЗначений - значение: идентификатор канала.
//
Функция ДоступныеКаналы() Экспорт

	Каналы = Новый СписокЗначений;
	Каналы.Добавить("Интерфейс", НСтр("ru = 'В программе'"));
	Каналы.Добавить("Почта", НСтр("ru = 'Электронная почта'"));
	кбп_ПроцессыПереопределяемый.ПриРегистрацииКаналов(Каналы);
	Возврат Каналы;

КонецФункции

// События, которые настраиваются на вкладке «Оповещения» конструктора.
//
// Параметры:
//  ДляПроцесса - Булево - Истина: оповещения процесса целиком (с событиями процесса), Ложь — шага-задачи.
//
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.кбп_СобытияПроцессов
//
Функция СобытияДляНастройки(ДляПроцесса) Экспорт

	События = Перечисления.кбп_СобытияПроцессов;
	Результат = Новый Массив;
	Результат.Добавить(События.ЗадачаНазначена);
	Результат.Добавить(События.ЗадачаВыполнена);
	Результат.Добавить(События.ВозвратНаДоработку);
	Результат.Добавить(События.ЗадачаПросрочена);
	Если ДляПроцесса Тогда
		Результат.Добавить(События.ПроцессЗапущен);
		Результат.Добавить(События.ПроцессЗавершен);
		Результат.Добавить(События.ПроцессПрерван);
	КонецЕсли;
	Возврат Результат;

КонецФункции

// Параметры, которые можно вставить в шаблон сообщения (подсказка в форме шаблона).
//
// Возвращаемое значение:
//  Строка
//
Функция ОписаниеПараметровШаблона() Экспорт

	Возврат НСтр("ru = '[Процесс], [Схема], [Автор], [Предмет], [Задача], [Срок], [Исполнитель], [Инструкция], [Комментарий], [Ссылка];
		|через точку — реквизиты: [Предмет.Номер], [Предмет.Контрагент.ИНН], [Задача.Срок], [Процесс.ДатаСтарта];
		|переменные процесса: [Переменные.Сумма].'");

КонецФункции

// Уведомления канала «Интерфейс» текущего пользователя (ФТ-609).
//
// Параметры:
//  ТолькоНовые - Булево - только ещё не показанные всплывающим оповещением; они отмечаются показанными.
//
// Возвращаемое значение:
//  Структура - Непрочитанных (Число), Новые (Массив из Структура: Ид, Текст, Задача, Процесс).
//
Функция УведомленияПользователя(ТолькоНовые = Истина) Экспорт

	Пользователь = кбп_АдаптерКонфигурации.ТекущийПользователь();
	Результат = Новый Структура("Непрочитанных, Новые", 0, Новый Массив);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Уведомления.Ид КАК Ид,
	|	Уведомления.Текст КАК Текст,
	|	Уведомления.Задача КАК Задача,
	|	Уведомления.Процесс КАК Процесс,
	|	Уведомления.Показано КАК Показано
	|ИЗ
	|	РегистрСведений.кбп_УведомленияПользователей КАК Уведомления
	|ГДЕ
	|	Уведомления.Пользователь = &Пользователь
	|	И НЕ Уведомления.Прочитано
	|
	|УПОРЯДОЧИТЬ ПО
	|	Уведомления.Дата";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Непрочитанных = Результат.Непрочитанных + 1;
		Если ТолькоНовые И Выборка.Показано Тогда
			Продолжить;
		КонецЕсли;
		Результат.Новые.Добавить(Новый Структура("Ид, Текст, Задача, Процесс",
			Выборка.Ид, Выборка.Текст, Выборка.Задача, Выборка.Процесс));
	КонецЦикла;
	Если ТолькоНовые Тогда
		Для Каждого Уведомление Из Результат.Новые Цикл
			ОтметитьУведомление(Пользователь, Уведомление.Ид, "Показано");
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;

КонецФункции

// Отмечает уведомления текущего пользователя прочитанными.
//
// Параметры:
//  Идентификаторы - Массив из Строка, Неопределено - Неопределено: все уведомления пользователя.
//
Процедура ОтметитьПрочитанными(Идентификаторы = Неопределено) Экспорт

	Пользователь = кбп_АдаптерКонфигурации.ТекущийПользователь();
	Если Идентификаторы = Неопределено Тогда
		Идентификаторы = Новый Массив;
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Уведомления.Ид КАК Ид
		|ИЗ
		|	РегистрСведений.кбп_УведомленияПользователей КАК Уведомления
		|ГДЕ
		|	Уведомления.Пользователь = &Пользователь
		|	И НЕ Уведомления.Прочитано";
		Идентификаторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ид");
	КонецЕсли;
	Для Каждого Ид Из Идентификаторы Цикл
		ОтметитьУведомление(Пользователь, Ид, "Прочитано");
	КонецЦикла;

КонецПроцедуры

// Личные настройки оповещений (ФТ-607, ФТ-608) текущего пользователя для формы настроек.
//
// Возвращаемое значение:
//  Структура - Каналы, СпособГруппировки, ИнтервалМинут (общие) и События (ТаблицаЗначений: Событие, Получать, Каналы).
//
Функция НастройкиПользователя() Экспорт

	Пользователь = кбп_АдаптерКонфигурации.ТекущийПользователь();
	Набор = РегистрыСведений.кбп_ПодпискиПользователей.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(Пользователь);
	Набор.Прочитать();
	Результат = Новый Структура("Каналы, СпособГруппировки, ИнтервалМинут", "",
		Перечисления.кбп_СпособыГруппировкиОповещений.Сразу, 60);
	События = Новый ТаблицаЗначений;
	События.Колонки.Добавить("Событие");
	События.Колонки.Добавить("Получать");
	События.Колонки.Добавить("Каналы");
	ПоСобытиям = Новый Соответствие;
	Для Каждого Запись Из Набор Цикл
		Если ЗначениеЗаполнено(Запись.Событие) Тогда
			ПоСобытиям.Вставить(Запись.Событие, Запись);
		Иначе
			Результат.Каналы = Запись.Каналы;
			Если ЗначениеЗаполнено(Запись.СпособГруппировки) Тогда
				Результат.СпособГруппировки = Запись.СпособГруппировки;
			КонецЕсли;
			Если Запись.ИнтервалМинут > 0 Тогда
				Результат.ИнтервалМинут = Запись.ИнтервалМинут;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Для Каждого Событие Из СобытияПодписки() Цикл
		СтрокаСобытия = События.Добавить();
		СтрокаСобытия.Событие = Событие;
		Запись = ПоСобытиям[Событие];
		СтрокаСобытия.Получать = (Запись = Неопределено Или Не Запись.Отключено);
		СтрокаСобытия.Каналы = ?(Запись = Неопределено, "", Запись.Каналы);
	КонецЦикла;
	Результат.Вставить("События", События);
	Возврат Результат;

КонецФункции

// Записывает личные настройки оповещений текущего пользователя.
//
// Параметры:
//  Настройки - Структура - см. НастройкиПользователя; События — коллекция строк с полями Событие, Получать, Каналы.
//
Процедура ЗаписатьНастройкиПользователя(Настройки) Экспорт

	Пользователь = кбп_АдаптерКонфигурации.ТекущийПользователь();
	Набор = РегистрыСведений.кбп_ПодпискиПользователей.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(Пользователь);
	Запись = Набор.Добавить();
	Запись.Пользователь = Пользователь;
	Запись.Каналы = НормализованныеКаналы(Настройки.Каналы);
	Запись.СпособГруппировки = Настройки.СпособГруппировки;
	Запись.ИнтервалМинут = Настройки.ИнтервалМинут;
	Для Каждого СтрокаСобытия Из Настройки.События Цикл
		Если СтрокаСобытия.Получать И Не ЗначениеЗаполнено(СтрокаСобытия.Каналы) Тогда
			Продолжить;
		КонецЕсли;
		Запись = Набор.Добавить();
		Запись.Пользователь = Пользователь;
		Запись.Событие = СтрокаСобытия.Событие;
		Запись.Отключено = Не СтрокаСобытия.Получать;
		Запись.Каналы = НормализованныеКаналы(СтрокаСобытия.Каналы);
	КонецЦикла;
	Набор.Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Получатели

Процедура Оповестить(Событие, Процесс, Задача, Шаг, Контекст)

	Если Контекст = Неопределено Тогда
		Контекст = КонтекстСообщения(Процесс, Задача);
	КонецЕсли;
	Итерация = ?(Задача = Неопределено, "", XMLСтрока(Задача.Итерация));
	Получатели = Новый Массив;

	// Настроенные получатели идут первыми: при совпадении получателя и канала стандартное сообщение
	// отбрасывается защитой от дублей, а настроенный шаблон остаётся.
	Для Каждого Правило Из ПравилаОповещения(Процесс.ВерсияСхемы, Шаг, Событие) Цикл
		ОповеститьПоПравилу(Событие, Правило, Процесс, Задача, Контекст, Правило.Шаблон, Неопределено, Итерация,
			Получатели);
	КонецЦикла;

	События = Перечисления.кбп_СобытияПроцессов;
	Виды = Перечисления.кбп_ВидыПолучателейОповещений;
	Стандартный = Неопределено;
	Если Задача <> Неопределено И (Событие = События.ЗадачаНазначена Или Событие = События.ЗадачаПросрочена) Тогда
		Стандартный = Виды.Исполнитель;
	ИначеЕсли Событие = События.ПроцессЗавершен Или Событие = События.ПроцессПрерван Тогда
		Стандартный = Виды.Автор;
	КонецЕсли;
	Если Стандартный <> Неопределено Тогда
		Правило = Новый Структура(ПоляПравила());
		Правило.ВидПолучателя = Стандартный;
		ОповеститьПоПравилу(Событие, Правило, Процесс, Задача, Контекст, Неопределено, Неопределено, Итерация,
			Получатели);
	КонецЕсли;

КонецПроцедуры

// Ставит в очередь сообщения по одному правилу (строке кбп_ОповещенияШагов).
Процедура ОповеститьПоПравилу(Событие, Правило, Процесс, Задача, Контекст, Шаблон, ТекстПоУмолчанию, Итерация,
	Представления)

	Если кбп_Условия.УсловиеЗаполнено(Правило.Условие) И Не кбп_Условия.ОтборВыполняется(Правило.Условие, Контекст) Тогда
		Возврат;
	КонецЕсли;
	Данные = ДанныеШаблона(Процесс, Задача, Контекст);
	Для Каждого Получатель Из ПолучателиПравила(Правило, Процесс, Задача, Контекст) Цикл
		Если ЗначениеЗаполнено(Получатель.Пользователь) И Не Правило.Срочное
			И ОповещениеОтключено(Получатель.Пользователь, Событие) Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(Получатель.Адрес) Тогда
			Каналы = Новый Массив;
			Каналы.Добавить("Почта");
		Иначе
			Каналы = КаналыПолучателя(Правило.Каналы, Получатель.Пользователь, Событие);
		КонецЕсли;
		Для Каждого Канал Из Каналы Цикл
			Сообщение = НовоеСообщение(Событие, Канал);
			ЗаполнитьЗначенияСвойств(Сообщение, СообщениеПоШаблону(Шаблон, Канал, Событие, Данные, ТекстПоУмолчанию));
			Сообщение.Получатель = Получатель.Пользователь;
			Сообщение.Адрес = Получатель.Адрес;
			Сообщение.Процесс = Процесс;
			Сообщение.Задача = Задача;
			Сообщение.Срочное = Правило.Срочное;
			Сообщение.Ключ = СтрШаблон("%1|%2|%3|%4|%5", XMLСтрока(Событие),
				?(Задача = Неопределено, XMLСтрока(Процесс), XMLСтрока(Задача)),
				?(ЗначениеЗаполнено(Получатель.Адрес), Получатель.Адрес, XMLСтрока(Получатель.Пользователь)), Канал, Итерация);
			ПоставитьВОчередь(Сообщение);
		КонецЦикла;
		Представление = ?(ЗначениеЗаполнено(Получатель.Адрес), Получатель.Адрес, Строка(Получатель.Пользователь));
		Если Представления.Найти(Представление) = Неопределено Тогда
			Представления.Добавить(Представление);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Получатели по виду (ФТ-604). Замещение учитывается для исполнителя и роли.
//
// Возвращаемое значение:
//  Массив из Структура - Пользователь, Адрес.
//
Функция ПолучателиПравила(Правило, Процесс, Задача, Контекст)

	Виды = Перечисления.кбп_ВидыПолучателейОповещений;
	Вид = Правило.ВидПолучателя;
	СписокПользователей = Новый Массив;
	Адреса = Новый Массив;
	СЗаместителями = Ложь;
	Роль = Неопределено;

	Если Вид = Виды.Исполнитель Тогда
		Если Задача <> Неопределено Тогда
			СписокПользователей.Добавить(Задача.Назначенный);
			Роль = Задача.Роль;
		Иначе
			ДобавитьВМассив(СписокПользователей, ИсполнителиАктивныхЗадач(Процесс));
		КонецЕсли;
		СЗаместителями = Истина;

	ИначеЕсли Вид = Виды.Автор Тогда
		СписокПользователей.Добавить(Процесс.Автор);

	ИначеЕсли Вид = Виды.Наблюдатели Тогда
		ДобавитьВМассив(СписокПользователей, Процесс.Наблюдатели.ВыгрузитьКолонку("Пользователь"));

	ИначеЕсли Вид = Виды.Роль Тогда
		Объект1 = ?(Задача = Неопределено, Неопределено, Задача.ОбъектАдресации1);
		Объект2 = ?(Задача = Неопределено, Неопределено, Задача.ОбъектАдресации2);
		ДобавитьВМассив(СписокПользователей, кбп_Адресация.ИсполнителиРолиПоОбъектам(Правило.Роль, Объект1, Объект2));
		Роль = Правило.Роль;
		СЗаместителями = Истина;

	ИначеЕсли Вид = Виды.Пользователь Тогда
		СписокПользователей.Добавить(Правило.Пользователь);

	ИначеЕсли Вид = Виды.ИзРеквизита Тогда
		Значение = кбп_Адресация.ЗначениеПоПути(Контекст, Правило.РеквизитПредмета);
		Если ТипЗнч(Значение) = Тип("Строка") И СтрНайти(Значение, "@") > 0 Тогда
			ДобавитьВМассив(Адреса, РазобратьАдреса(Значение));
		Иначе
			СписокПользователей.Добавить(кбп_АдаптерКонфигурации.ПользовательПоЗначению(Значение));
		КонецЕсли;

	ИначеЕсли Вид = Виды.Адрес Тогда
		ДобавитьВМассив(Адреса, РазобратьАдреса(Правило.Адрес));

	ИначеЕсли Вид = Виды.Обработчик И ЗначениеЗаполнено(Правило.Обработчик) Тогда
		КонтекстОбработчика = Новый Структура("Процесс, Предмет, Автор, Пользователь, Задача, Переменные",
			Процесс, Контекст.Предмет, Контекст.Автор, Контекст.Пользователь, Задача, Контекст.Переменные);
		КонтекстОбработчика.Вставить("Получатели", Новый Массив);
		кбп_Действия.ВыполнитьОбработчик(Правило.Обработчик, КонтекстОбработчика);
		Для Каждого Значение Из КонтекстОбработчика.Получатели Цикл
			Если ТипЗнч(Значение) = Тип("Строка") Тогда
				ДобавитьВМассив(Адреса, РазобратьАдреса(Значение));
			Иначе
				СписокПользователей.Добавить(Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Результат = Новый Массив;
	Добавленные = Новый Соответствие;
	Для Каждого Пользователь Из СписокПользователей Цикл
		ДобавитьПолучателя(Результат, Добавленные, Пользователь, "");
		Если СЗаместителями И ЗначениеЗаполнено(Пользователь) Тогда
			Для Каждого Заместитель Из кбп_Адресация.ЗаместителиПользователя(Пользователь, Роль, Процесс.Схема) Цикл
				ДобавитьПолучателя(Результат, Добавленные, Заместитель, "");
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Для Каждого Адрес Из Адреса Цикл
		ДобавитьПолучателя(Результат, Добавленные, Неопределено, Адрес);
	КонецЦикла;
	Возврат Результат;

КонецФункции

Процедура ДобавитьПолучателя(Результат, Добавленные, Пользователь, Адрес)

	Если ЗначениеЗаполнено(Адрес) Тогда
		Ключ = НРег(Адрес);
	ИначеЕсли ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") И ЗначениеЗаполнено(Пользователь) Тогда
		Ключ = Пользователь;
	Иначе
		Возврат;
	КонецЕсли;
	Если Добавленные[Ключ] <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	Добавленные.Вставить(Ключ, Истина);
	Результат.Добавить(Новый Структура("Пользователь, Адрес",
		?(ЗначениеЗаполнено(Адрес), Справочники.Пользователи.ПустаяСсылка(), Пользователь), Адрес));

КонецПроцедуры

Функция ИсполнителиАктивныхЗадач(Процесс)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Процесс", Процесс);
	Запрос.УстановитьПараметр("Состояния", кбп_Движок.СостоянияАктивных());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Задачи.Назначенный КАК Назначенный
	|ИЗ
	|	Справочник.кбп_Задачи КАК Задачи
	|ГДЕ
	|	Задачи.Процесс = &Процесс
	|	И Задачи.Состояние В (&Состояния)";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Назначенный");

КонецФункции

Функция РазобратьАдреса(ТекстАдресов)

	Результат = Новый Массив;
	Для Каждого Часть Из СтрРазделить(СтрЗаменить(ТекстАдресов, ",", ";"), ";", Ложь) Цикл
		Адрес = СокрЛП(Часть);
		Если СтрНайти(Адрес, "@") > 0 Тогда
			Результат.Добавить(Адрес);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

Процедура ДобавитьВМассив(Приемник, Источник)
	Для Каждого Элемент Из Источник Цикл
		Приемник.Добавить(Элемент);
	КонецЦикла;
КонецПроцедуры

// Строки кбп_ОповещенияШагов версии: шага (Шаг заполнен) и процесса целиком (пустой шаг).
// Событие Неопределено — все строки шага (шаг «Оповещение»).
Функция ПравилаОповещения(Версия, Шаг, Событие)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версия", Версия);
	Шаги = Новый Массив;
	Шаги.Добавить(Справочники.кбп_ЭлементыСхем.ПустаяСсылка());
	Если ЗначениеЗаполнено(Шаг) Тогда
		Шаги.Добавить(Шаг);
	КонецЕсли;
	Запрос.УстановитьПараметр("Шаги", Шаги);
	Запрос.УстановитьПараметр("Шаг", Шаг);
	Запрос.УстановитьПараметр("Событие", Событие);
	Запрос.УстановитьПараметр("ВсеСобытия", Событие = Неопределено);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Оповещения.ВидПолучателя КАК ВидПолучателя,
	|	Оповещения.Роль КАК Роль,
	|	Оповещения.Пользователь КАК Пользователь,
	|	Оповещения.РеквизитПредмета КАК РеквизитПредмета,
	|	Оповещения.Адрес КАК Адрес,
	|	Оповещения.Обработчик КАК Обработчик,
	|	Оповещения.Каналы КАК Каналы,
	|	Оповещения.Шаблон КАК Шаблон,
	|	Оповещения.Срочное КАК Срочное,
	|	Оповещения.Условие КАК Условие
	|ИЗ
	|	РегистрСведений.кбп_ОповещенияШагов КАК Оповещения
	|ГДЕ
	|	Оповещения.Версия = &Версия
	|	И ВЫБОР
	|			КОГДА &ВсеСобытия
	|				ТОГДА Оповещения.Шаг = &Шаг
	|			ИНАЧЕ Оповещения.Шаг В (&Шаги)
	|					И Оповещения.Событие = &Событие
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Оповещения.Шаг,
	|	Оповещения.НомерЗаписи";
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ПоляПравила()
	Возврат "ВидПолучателя, Роль, Пользователь, РеквизитПредмета, Адрес, Обработчик, Каналы, Шаблон, Срочное, Условие";
КонецФункции

Функция КонтекстСообщения(Процесс, Задача)

	Переменные = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из Процесс.Переменные Цикл
		Переменные.Вставить(СтрокаТаблицы.Переменная.Имя, СтрокаТаблицы.Значение);
	КонецЦикла;
	Контекст = Новый Структура("Процесс, Схема, Версия, Предмет, Автор, Пользователь, Задача, ИдКнопки, Комментарий, Переменные",
		Процесс, Процесс.Схема, Процесс.ВерсияСхемы, Процесс.Предмет, Процесс.Автор,
		кбп_АдаптерКонфигурации.ТекущийПользователь(), Задача, "", "", Переменные);
	Если Задача <> Неопределено Тогда
		Контекст.ИдКнопки = Задача.Результат;
		Контекст.Комментарий = Задача.Комментарий;
	КонецЕсли;
	Возврат Контекст;

КонецФункции

#КонецОбласти

#Область КаналыИПодписки

// Каналы получателя: из строки настройки, иначе из личных настроек, иначе «Интерфейс» и «Почта».
Функция КаналыПолучателя(КаналыПравила, Получатель, Событие)

	СписокКаналов = СокрЛП(КаналыПравила);
	Если Не ЗначениеЗаполнено(СписокКаналов) И ЗначениеЗаполнено(Получатель) Тогда
		СписокКаналов = НастройкаПодписки(Получатель, Событие).Каналы;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СписокКаналов) Тогда
		СписокКаналов = кбп_ПроцессыСлужебный.Настройка("КаналыПоУмолчанию");
	КонецЕсли;
	Доступные = ДоступныеКаналы();
	ПочтаВключена = кбп_ПроцессыСлужебный.Настройка("ОтправлятьПочту");
	Результат = Новый Массив;
	Для Каждого Часть Из СтрРазделить(СписокКаналов, ",;", Ложь) Цикл
		Канал = СокрЛП(Часть);
		Если Доступные.НайтиПоЗначению(Канал) = Неопределено Или Результат.Найти(Канал) <> Неопределено
			Или Канал = "Почта" И Не ПочтаВключена Тогда
			Продолжить;
		КонецЕсли;
		Результат.Добавить(Канал);
	КонецЦикла;
	Возврат Результат;

КонецФункции

Функция НормализованныеКаналы(СписокКаналов)

	Части = Новый Массив;
	Для Каждого Часть Из СтрРазделить(СписокКаналов, ",;", Ложь) Цикл
		Если ЗначениеЗаполнено(СокрЛП(Часть)) Тогда
			Части.Добавить(СокрЛП(Часть));
		КонецЕсли;
	КонецЦикла;
	Возврат Лев(СтрСоединить(Части, ", "), 255);

КонецФункции

// Личная настройка пользователя: строка события, иначе общая строка пользователя.
Функция НастройкаПодписки(Пользователь, Событие)

	Результат = Новый Структура("Отключено, Каналы, СпособГруппировки, ИнтервалМинут", Ложь, "",
		Перечисления.кбп_СпособыГруппировкиОповещений.Сразу, 0);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Событие", Событие);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Подписки.Событие КАК Событие,
	|	Подписки.Отключено КАК Отключено,
	|	Подписки.Каналы КАК Каналы,
	|	Подписки.СпособГруппировки КАК СпособГруппировки,
	|	Подписки.ИнтервалМинут КАК ИнтервалМинут
	|ИЗ
	|	РегистрСведений.кбп_ПодпискиПользователей КАК Подписки
	|ГДЕ
	|	Подписки.Пользователь = &Пользователь
	|	И Подписки.Событие В (&Событие, ЗНАЧЕНИЕ(Перечисление.кбп_СобытияПроцессов.ПустаяСсылка))";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Событие) Тогда
			Результат.Отключено = Выборка.Отключено;
			Если ЗначениеЗаполнено(Выборка.Каналы) Тогда
				Результат.Каналы = Выборка.Каналы;
			КонецЕсли;
		Иначе
			Если Не ЗначениеЗаполнено(Результат.Каналы) Тогда
				Результат.Каналы = Выборка.Каналы;
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.СпособГруппировки) Тогда
				Результат.СпособГруппировки = Выборка.СпособГруппировки;
			КонецЕсли;
			Результат.ИнтервалМинут = Выборка.ИнтервалМинут;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

Функция ОповещениеОтключено(Получатель, Событие)
	Возврат НастройкаПодписки(Получатель, Событие).Отключено;
КонецФункции

// События, от которых пользователь может отписаться в личных настройках.
Функция СобытияПодписки()

	События = Перечисления.кбп_СобытияПроцессов;
	Результат = Новый Массив;
	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.кбп_СобытияПроцессов.ЗначенияПеречисления Цикл
		Событие = События[ЗначениеПеречисления.Имя];
		Если Событие <> События.Дайджест И Событие <> События.Упоминание И Событие <> События.НовыйКомментарий
			И Событие <> События.СрокИстекает Тогда
			Результат.Добавить(Событие);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область Шаблоны

// Тема и текст (ФТ-603): шаблон (с текстом для канала), иначе текст шага, иначе шаблон события, иначе встроенный текст.
Функция СообщениеПоШаблону(Шаблон, Канал, Событие, Данные, ТекстПоУмолчанию)

	Результат = Новый Структура("Тема, Текст, ЭтоHTML", "", "", Ложь);
	Если ЗначениеЗаполнено(Шаблон) Тогда
		ЗаполнитьЗначенияСвойств(Результат, ТекстШаблона(Шаблон, Канал));
	ИначеЕсли ТекстПоУмолчанию <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Результат, ТекстПоУмолчанию);
	Иначе
		ШаблонСобытия = ШаблонСобытия(Событие);
		Если ЗначениеЗаполнено(ШаблонСобытия) Тогда
			ЗаполнитьЗначенияСвойств(Результат, ТекстШаблона(ШаблонСобытия, Канал));
		Иначе
			ЗаполнитьЗначенияСвойств(Результат, ВстроенныйТекст(Событие));
		КонецЕсли;
	КонецЕсли;
	Результат.Тема = ПодставитьПараметры(Результат.Тема, Данные);
	Результат.Текст = ПодставитьПараметры(Результат.Текст, Данные);
	Возврат Результат;

КонецФункции

Функция ТекстШаблона(Шаблон, Канал)

	Результат = Новый Структура("Тема, Текст, ЭтоHTML", Шаблон.Тема, Шаблон.Текст, Шаблон.ЭтоHTML);
	Если Не ЗначениеЗаполнено(Результат.Тема) Тогда
		Результат.Тема = Шаблон.Наименование;
	КонецЕсли;
	Для Каждого СтрокаКанала Из Шаблон.ТекстыПоКаналам Цикл
		Если СокрЛП(СтрокаКанала.Канал) <> Канал Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаКанала.Тема) Тогда
			Результат.Тема = СтрокаКанала.Тема;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаКанала.Текст) Тогда
			Результат.Текст = СтрокаКанала.Текст;
			Результат.ЭтоHTML = СтрокаКанала.ЭтоHTML;
		КонецЕсли;
		Прервать;
	КонецЦикла;
	Возврат Результат;

КонецФункции

Функция ВстроенныйТекст(Событие)

	События = Перечисления.кбп_СобытияПроцессов;
	Результат = Новый Структура("Тема, Текст, ЭтоHTML", "", "", Ложь);
	Если Событие = События.ЗадачаНазначена Тогда
		Результат.Тема = НСтр("ru = 'Новая задача: [Задача]'");
		Результат.Текст = НСтр("ru = 'Вам назначена задача «[Задача]».
			|Процесс: [Процесс]
			|Предмет: [Предмет]
			|Срок: [Срок]
			|
			|[Инструкция]
			|
			|Открыть задачу: [Ссылка]'");
	ИначеЕсли Событие = События.ЗадачаПросрочена Тогда
		Результат.Тема = НСтр("ru = 'Просрочена задача: [Задача]'");
		Результат.Текст = НСтр("ru = 'Истёк срок задачи «[Задача]» (срок [Срок], исполнитель [Исполнитель]).
			|Процесс: [Процесс]
			|Предмет: [Предмет]
			|
			|Открыть задачу: [Ссылка]'");
	ИначеЕсли Событие = События.ЗадачаВыполнена Тогда
		Результат.Тема = НСтр("ru = 'Выполнена задача: [Задача]'");
		Результат.Текст = НСтр("ru = 'Задача «[Задача]» выполнена: [Результат].
			|Процесс: [Процесс]
			|Предмет: [Предмет]
			|Комментарий: [Комментарий]
			|
			|Открыть задачу: [Ссылка]'");
	ИначеЕсли Событие = События.ВозвратНаДоработку Тогда
		Результат.Тема = НСтр("ru = 'Возврат на доработку: [Процесс]'");
		Результат.Текст = НСтр("ru = 'Задача «[Задача]» возвращена на доработку.
			|Процесс: [Процесс]
			|Предмет: [Предмет]
			|Комментарий: [Комментарий]
			|
			|Открыть задачу: [Ссылка]'");
	ИначеЕсли Событие = События.ПроцессЗапущен Тогда
		Результат.Тема = НСтр("ru = 'Запущен процесс: [Процесс]'");
		Результат.Текст = НСтр("ru = 'Запущен процесс «[Процесс]» (автор [Автор]).
			|Предмет: [Предмет]
			|
			|Открыть процесс: [Ссылка]'");
	ИначеЕсли Событие = События.ПроцессЗавершен Тогда
		Результат.Тема = НСтр("ru = 'Процесс завершён: [Процесс]'");
		Результат.Текст = НСтр("ru = 'Процесс «[Процесс]» завершён.
			|
			|Открыть процесс: [Ссылка]'");
	ИначеЕсли Событие = События.ПроцессПрерван Тогда
		Результат.Тема = НСтр("ru = 'Процесс прерван: [Процесс]'");
		Результат.Текст = НСтр("ru = 'Процесс «[Процесс]» прерван.
			|
			|Открыть процесс: [Ссылка]'");
	Иначе
		Результат.Тема = СтрШаблон("%1: [Процесс]", Событие);
		Результат.Текст = НСтр("ru = 'Открыть: [Ссылка]'");
	КонецЕсли;
	Возврат Результат;

КонецФункции

// Данные для подстановки: готовые значения простых параметров и контекст для путей через точку.
Функция ДанныеШаблона(Процесс, Задача, Контекст)

	ПараметрыШаблона = Новый Соответствие;
	ПараметрыШаблона.Вставить("процесс", Строка(Процесс));
	ПараметрыШаблона.Вставить("схема", Строка(Процесс.Схема));
	ПараметрыШаблона.Вставить("автор", Строка(Процесс.Автор));
	ПараметрыШаблона.Вставить("предмет", ?(ЗначениеЗаполнено(Процесс.ПредставлениеПредмета), Процесс.ПредставлениеПредмета, "—"));
	ПараметрыШаблона.Вставить("комментарий", Контекст.Комментарий);
	Если Задача <> Неопределено Тогда
		ПараметрыШаблона.Вставить("задача", Строка(Задача));
		ПараметрыШаблона.Вставить("срок", ?(ЗначениеЗаполнено(Задача.Срок), Формат(Задача.Срок, "ДЛФ=DT"), НСтр("ru = 'не указан'")));
		ПараметрыШаблона.Вставить("инструкция", Задача.Шаг.Инструкция);
		ПараметрыШаблона.Вставить("исполнитель", Строка(Задача.Назначенный));
		ПараметрыШаблона.Вставить("результат", ?(ЗначениеЗаполнено(Задача.Результат),
			кбп_Действия.ЗаголовокКнопки(Задача.Шаг, Задача.Результат), ""));
		ПараметрыШаблона.Вставить("ссылка", кбп_АдаптерКонфигурации.ВнешняяСсылка(Задача));
	Иначе
		Для Каждого Имя Из СтрРазделить("задача,срок,инструкция,исполнитель,результат", ",") Цикл
			ПараметрыШаблона.Вставить(Имя, "");
		КонецЦикла;
		ПараметрыШаблона.Вставить("ссылка", кбп_АдаптерКонфигурации.ВнешняяСсылка(Процесс));
	КонецЕсли;
	Объекты = Новый Соответствие;
	Объекты.Вставить("процесс", Процесс);
	Объекты.Вставить("задача", Задача);
	Объекты.Вставить("схема", Процесс.Схема);
	Объекты.Вставить("автор", Процесс.Автор);
	Объекты.Вставить("предмет", Контекст.Предмет);
	Объекты.Вставить("объект", Контекст.Предмет);
	Возврат Новый Структура("Параметры, Объекты, Переменные", ПараметрыШаблона, Объекты, Контекст.Переменные);

КонецФункции

// Заменяет [Имя] и [Имя.Путь] значениями. Неизвестные параметры остаются как есть.
Функция ПодставитьПараметры(Знач Текст, Данные)

	Если Не ЗначениеЗаполнено(Текст) Или СтрНайти(Текст, "[") = 0 Тогда
		Возврат Текст;
	КонецЕсли;
	Результат = "";
	Пока Истина Цикл
		Начало = СтрНайти(Текст, "[");
		Если Начало = 0 Тогда
			Прервать;
		КонецЕсли;
		Конец = СтрНайти(Текст, "]", , Начало);
		Если Конец = 0 Тогда
			Прервать;
		КонецЕсли;
		Имя = Сред(Текст, Начало + 1, Конец - Начало - 1);
		Значение = ЗначениеПараметра(Имя, Данные);
		Результат = Результат + Лев(Текст, Начало - 1)
			+ ?(Значение = Неопределено, "[" + Имя + "]", Значение);
		Текст = Сред(Текст, Конец + 1);
	КонецЦикла;
	Возврат Результат + Текст;

КонецФункции

Функция ЗначениеПараметра(Знач Имя, Данные)

	Имя = СокрЛП(Имя);
	Если Не ЗначениеЗаполнено(Имя) Или СтрНайти(Имя, " ") > 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Простое = Данные.Параметры[НРег(Имя)];
	Если Простое <> Неопределено Тогда
		Возврат Простое;
	КонецЕсли;

	Части = СтрРазделить(Имя, ".", Ложь);
	Если Части.Количество() < 2 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Корень = НРег(Части[0]);
	Если Корень = "переменные" Тогда
		Значение = Данные.Переменные[Части[1]];
		Начало = 2;
	ИначеЕсли Данные.Объекты.Количество() > 0
		И СтрРазделить("процесс,задача,схема,автор,предмет,объект", ",").Найти(Корень) <> Неопределено Тогда
		Значение = Данные.Объекты[Корень];
		Начало = 1;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	Для Индекс = Начало По Части.ВГраница() Цикл
		Если Не ЗначениеЗаполнено(Значение) Тогда
			Возврат "";
		КонецЕсли;
		Попытка
			Значение = Значение[Части[Индекс]];
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЦикла;
	Возврат ПредставлениеЗначения(Значение);

КонецФункции

Функция ПредставлениеЗначения(Значение)

	ТипЗначения = ТипЗнч(Значение);
	Если Значение = Неопределено Или Значение = Null Тогда
		Возврат "";
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		Возврат ?(ЗначениеЗаполнено(Значение), Формат(Значение, "ДЛФ=DT"), "");
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		Возврат Формат(Значение, "ЧН=0");
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		Возврат Формат(Значение, НСтр("ru = 'БЛ=Нет; БИ=Да'"));
	КонецЕсли;
	Возврат Строка(Значение);

КонецФункции

Функция ШаблонСобытия(Событие)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Событие", Событие);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Шаблоны.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.кбп_ШаблоныСообщений КАК Шаблоны
	|ГДЕ
	|	Шаблоны.Событие = &Событие
	|	И НЕ Шаблоны.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Шаблоны.Наименование";
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);

КонецФункции

#КонецОбласти

#Область Очередь

Функция НовоеСообщение(Событие, Канал)
	Возврат Новый Структура("Событие, Канал, Получатель, Адрес, Тема, Текст, ЭтоHTML, Процесс, Задача, Ключ, Срочное",
		Событие, Канал, Неопределено, "", "", "", Ложь, Неопределено, Неопределено, "", Ложь);
КонецФункции

// Запись в кбп_ОчередьОповещений с защитой от дублей (ФТ-606) и группировкой в дайджест (ФТ-608).
Процедура ПоставитьВОчередь(Сообщение)

	Если Не ЗначениеЗаполнено(Сообщение.Получатель) И Не ЗначениеЗаполнено(Сообщение.Адрес) Тогда
		Возврат;
	КонецЕсли;
	Ключ = Лев(Сообщение.Ключ, 150);
	Если ЕстьВОчереди(Ключ) Тогда
		Возврат;
	КонецЕсли;

	Сейчас = ТекущаяДатаСеанса();
	Запись = РегистрыСведений.кбп_ОчередьОповещений.СоздатьМенеджерЗаписи();
	Запись.Ид = Строка(Новый УникальныйИдентификатор);
	Запись.Канал = Сообщение.Канал;
	Запись.Событие = Сообщение.Событие;
	Если ЗначениеЗаполнено(Сообщение.Получатель) Тогда
		Запись.Получатель = Сообщение.Получатель;
	КонецЕсли;
	Запись.Адрес = Сообщение.Адрес;
	Запись.Тема = Лев(Сообщение.Тема, 255);
	Запись.Текст = Сообщение.Текст;
	Запись.ЭтоHTML = Сообщение.ЭтоHTML;
	Если ЗначениеЗаполнено(Сообщение.Процесс) Тогда
		Запись.Процесс = Сообщение.Процесс;
	КонецЕсли;
	Если ЗначениеЗаполнено(Сообщение.Задача) Тогда
		Запись.Задача = Сообщение.Задача;
	КонецЕсли;
	Запись.КлючДедупликации = Ключ;
	Запись.Статус = Перечисления.кбп_СтатусыОчереди.Ожидает;
	Запись.ДатаСоздания = Сейчас;
	Запись.ОтправитьПосле = Сейчас;
	Если Сообщение.Канал = "Почта" И Не Сообщение.Срочное И ЗначениеЗаполнено(Сообщение.Получатель) Тогда
		ОтправитьПосле = ВремяДайджеста(Сообщение.Получатель, Сообщение.Событие);
		Если ОтправитьПосле <> Неопределено Тогда
			Запись.Статус = Перечисления.кбп_СтатусыОчереди.ОжидаетГруппировки;
			Запись.ОтправитьПосле = ОтправитьПосле;
		КонецЕсли;
	КонецЕсли;
	Запись.Записать();

КонецПроцедуры

// Когда отправить дайджест: Неопределено — сразу (без группировки).
Функция ВремяДайджеста(Получатель, Событие)

	Настройка = НастройкаПодписки(Получатель, Событие);
	Способы = Перечисления.кбп_СпособыГруппировкиОповещений;
	Сейчас = ТекущаяДатаСеанса();
	Если Настройка.СпособГруппировки = Способы.РазВNМинут Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Получатель", Получатель);
		Запрос.УстановитьПараметр("Статус", Перечисления.кбп_СтатусыОчереди.ОжидаетГруппировки);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МИНИМУМ(Очередь.ОтправитьПосле) КАК ОтправитьПосле
		|ИЗ
		|	РегистрСведений.кбп_ОчередьОповещений КАК Очередь
		|ГДЕ
		|	Очередь.Получатель = &Получатель
		|	И Очередь.Статус = &Статус
		|	И Очередь.Канал = ""Почта""";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ОтправитьПосле) Тогда
			Возврат Выборка.ОтправитьПосле;
		КонецЕсли;
		Возврат Сейчас + 60 * Макс(Настройка.ИнтервалМинут, 5);
	ИначеЕсли Настройка.СпособГруппировки = Способы.РазВДень Тогда
		Время = НачалоДня(Сейчас) + 3600 * кбп_ПроцессыСлужебный.Настройка("НачалоРабочегоДня");
		Возврат ?(Время > Сейчас, Время, Время + 86400);
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

Процедура ОтправитьСообщение(Ид)

	Запись = РегистрыСведений.кбп_ОчередьОповещений.СоздатьМенеджерЗаписи();
	Запись.Ид = Ид;
	Запись.Прочитать();
	Если Не Запись.Выбран() Или Запись.Статус <> Перечисления.кбп_СтатусыОчереди.Ожидает Тогда
		Возврат;
	КонецЕсли;

	Попытка
		Если Запись.Канал = "Интерфейс" Тогда
			ЗаписатьУведомление(Запись);
		ИначеЕсли Запись.Канал = "Почта" Или Не ЗначениеЗаполнено(Запись.Канал) Тогда
			Адрес = Запись.Адрес;
			Если Не ЗначениеЗаполнено(Адрес) Тогда
				Адрес = кбп_АдаптерКонфигурации.АдресЭлектроннойПочты(Запись.Получатель);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Адрес) Тогда
				Запись.Статус = Перечисления.кбп_СтатусыОчереди.Отменено;
				Запись.Ошибка = СтрШаблон(НСтр("ru = 'У пользователя %1 не указан адрес электронной почты.'"), Запись.Получатель);
				Запись.Записать();
				Возврат;
			КонецЕсли;
			Письмо = Новый Структура("Кому, Тема, Текст, ЭтоHTML", Адрес, Запись.Тема, Запись.Текст, Запись.ЭтоHTML);
			кбп_АдаптерКонфигурации.ОтправитьПочту(Письмо);
		Иначе
			Сообщение = Новый Структура("Канал, Событие, Получатель, Адрес, Тема, Текст, ЭтоHTML, Процесс, Задача");
			ЗаполнитьЗначенияСвойств(Сообщение, Запись);
			Отправлено = Ложь;
			кбп_ПроцессыПереопределяемый.ПриОтправкеОповещения(Запись.Канал, Сообщение, Отправлено);
			Если Не Отправлено Тогда
				ВызватьИсключение СтрШаблон(НСтр("ru = 'Канал «%1» не поддерживается: нет обработчика отправки.'"), Запись.Канал);
			КонецЕсли;
		КонецЕсли;
		Запись.Статус = Перечисления.кбп_СтатусыОчереди.Выполнено;
		Запись.ДатаОтправки = ТекущаяДатаСеанса();
		Запись.Ошибка = "";
	Исключение
		ОшибкаОтправки(Запись, ИнформацияОбОшибке());
	КонецПопытки;
	Запись.Записать();

КонецПроцедуры

// Повтор с экспоненциальной задержкой, после 5 попыток — статус «Ошибка» (ФТ-606).
Процедура ОшибкаОтправки(Запись, Информация)

	Запись.Попыток = Запись.Попыток + 1;
	Запись.Ошибка = ОбработкаОшибок.КраткоеПредставлениеОшибки(Информация);
	Если Запись.Попыток >= 5 Тогда
		Запись.Статус = Перечисления.кбп_СтатусыОчереди.Ошибка;
	Иначе
		Запись.Статус = Перечисления.кбп_СтатусыОчереди.Ожидает;
		Запись.ОтправитьПосле = ТекущаяДатаСеанса() + 60 * Pow(2, Запись.Попыток);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьУведомление(Запись)

	Если Не ЗначениеЗаполнено(Запись.Получатель) Тогда
		ВызватьИсключение НСтр("ru = 'Для канала «В программе» нужен пользователь-получатель.'");
	КонецЕсли;
	Текст = Запись.Тема;
	Если Не Запись.ЭтоHTML И ЗначениеЗаполнено(Запись.Текст) Тогда
		Текст = Текст + Символы.ПС + Запись.Текст;
	КонецЕсли;
	Уведомление = РегистрыСведений.кбп_УведомленияПользователей.СоздатьМенеджерЗаписи();
	Уведомление.Пользователь = Запись.Получатель;
	Уведомление.Ид = Запись.Ид;
	Уведомление.Дата = ТекущаяДатаСеанса();
	Уведомление.Текст = Текст;
	Уведомление.Процесс = Запись.Процесс;
	Уведомление.Задача = Запись.Задача;
	Уведомление.Записать();

КонецПроцедуры

Процедура ОтметитьУведомление(Пользователь, Ид, ИмяПоля)

	Уведомление = РегистрыСведений.кбп_УведомленияПользователей.СоздатьМенеджерЗаписи();
	Уведомление.Пользователь = Пользователь;
	Уведомление.Ид = Ид;
	Уведомление.Прочитать();
	Если Уведомление.Выбран() И Не Уведомление[ИмяПоля] Тогда
		Уведомление[ИмяПоля] = Истина;
		Уведомление.Показано = Истина;
		Уведомление.Записать();
	КонецЕсли;

КонецПроцедуры

// Собирает сообщения «Ожидает группировки», время которых наступило, в одно письмо на получателя (ФТ-608).
Процедура ОтправитьДайджесты()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Статус", Перечисления.кбп_СтатусыОчереди.ОжидаетГруппировки);
	Запрос.УстановитьПараметр("Сейчас", ТекущаяДатаСеанса());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Очередь.Ид КАК Ид,
	|	Очередь.Получатель КАК Получатель,
	|	Очередь.Тема КАК Тема,
	|	Очередь.Текст КАК Текст,
	|	Очередь.ЭтоHTML КАК ЭтоHTML
	|ИЗ
	|	РегистрСведений.кбп_ОчередьОповещений КАК Очередь
	|ГДЕ
	|	Очередь.Статус = &Статус
	|	И Очередь.Получатель В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Готовые.Получатель
	|			ИЗ
	|				РегистрСведений.кбп_ОчередьОповещений КАК Готовые
	|			ГДЕ
	|				Готовые.Статус = &Статус
	|				И Готовые.ОтправитьПосле <= &Сейчас)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Очередь.Получатель,
	|	Очередь.ДатаСоздания
	|ИТОГИ ПО
	|	Получатель";
	ПоПолучателям = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ПоПолучателям.Следующий() Цикл
		Идентификаторы = Новый Массив;
		Пункты = Новый Массив;
		Выборка = ПоПолучателям.Выбрать();
		Пока Выборка.Следующий() Цикл
			Идентификаторы.Добавить(Выборка.Ид);
			Пункт = "• " + Выборка.Тема;
			Если Не Выборка.ЭтоHTML И ЗначениеЗаполнено(Выборка.Текст) Тогда
				Пункт = Пункт + Символы.ПС + "  " + СтрЗаменить(СокрЛП(Выборка.Текст), Символы.ПС, Символы.ПС + "  ");
			КонецЕсли;
			Пункты.Добавить(Пункт);
		КонецЦикла;
		ОтправитьДайджест(ПоПолучателям.Получатель, Идентификаторы, Пункты);
	КонецЦикла;

КонецПроцедуры

Процедура ОтправитьДайджест(Получатель, Идентификаторы, Пункты)

	Данные = Новый Структура("Параметры, Объекты, Переменные", Новый Соответствие, Новый Соответствие, Новый Соответствие);
	Данные.Параметры.Вставить("количество", Формат(Пункты.Количество(), "ЧГ=0"));
	Данные.Параметры.Вставить("список", СтрСоединить(Пункты, Символы.ПС + Символы.ПС));
	Данные.Параметры.Вставить("получатель", Строка(Получатель));
	Сообщение = Новый Структура("Тема, Текст, ЭтоHTML", НСтр("ru = 'Оповещения по процессам: [Количество]'"),
		НСтр("ru = '[Список]'"), Ложь);
	Шаблон = ШаблонСобытия(Перечисления.кбп_СобытияПроцессов.Дайджест);
	Если ЗначениеЗаполнено(Шаблон) Тогда
		ЗаполнитьЗначенияСвойств(Сообщение, ТекстШаблона(Шаблон, "Почта"));
	КонецЕсли;
	Тема = ПодставитьПараметры(Сообщение.Тема, Данные);
	Текст = ПодставитьПараметры(Сообщение.Текст, Данные);

	Статусы = Перечисления.кбп_СтатусыОчереди;
	Ошибка = "";
	Адрес = кбп_АдаптерКонфигурации.АдресЭлектроннойПочты(Получатель);
	Если Не ЗначениеЗаполнено(Адрес) Тогда
		Статус = Статусы.Отменено;
		Ошибка = СтрШаблон(НСтр("ru = 'У пользователя %1 не указан адрес электронной почты.'"), Получатель);
	Иначе
		Попытка
			кбп_АдаптерКонфигурации.ОтправитьПочту(Новый Структура("Кому, Тема, Текст, ЭтоHTML", Адрес, Тема, Текст,
				Сообщение.ЭтоHTML));
			Статус = Статусы.Выполнено;
		Исключение
			// Дайджест не отправлен: сообщения переходят в обычную очередь с повторами.
			Статус = Статусы.Ожидает;
			Ошибка = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЕсли;

	Для Каждого Ид Из Идентификаторы Цикл
		Запись = РегистрыСведений.кбп_ОчередьОповещений.СоздатьМенеджерЗаписи();
		Запись.Ид = Ид;
		Запись.Прочитать();
		Если Не Запись.Выбран() Тогда
			Продолжить;
		КонецЕсли;
		Запись.Статус = Статус;
		Запись.Ошибка = Ошибка;
		Если Статус = Статусы.Выполнено Тогда
			Запись.ДатаОтправки = ТекущаяДатаСеанса();
		ИначеЕсли Статус = Статусы.Ожидает Тогда
			Запись.Попыток = Запись.Попыток + 1;
			Запись.ОтправитьПосле = ТекущаяДатаСеанса() + 60 * Pow(2, Запись.Попыток);
		КонецЕсли;
		Запись.Записать();
	КонецЦикла;

КонецПроцедуры

Функция ЕстьВОчереди(Ключ)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ключ", Ключ);
	Запрос.УстановитьПараметр("Статусы", СтатусыВРаботе());
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Очередь.Ид КАК Ид
	|ИЗ
	|	РегистрСведений.кбп_ОчередьОповещений КАК Очередь
	|ГДЕ
	|	Очередь.КлючДедупликации = &Ключ
	|	И Очередь.Статус В (&Статусы)";
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

Функция ЕстьКОтправке()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ожидает", Перечисления.кбп_СтатусыОчереди.Ожидает);
	Запрос.УстановитьПараметр("Сейчас", ТекущаяДатаСеанса());
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Очередь.Ид КАК Ид
	|ИЗ
	|	РегистрСведений.кбп_ОчередьОповещений КАК Очередь
	|ГДЕ
	|	Очередь.Статус = &Ожидает
	|	И Очередь.ОтправитьПосле <= &Сейчас";
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

Функция СтатусыВРаботе()

	Статусы = Новый Массив;
	Статусы.Добавить(Перечисления.кбп_СтатусыОчереди.Ожидает);
	Статусы.Добавить(Перечисления.кбп_СтатусыОчереди.ОжидаетГруппировки);
	Статусы.Добавить(Перечисления.кбп_СтатусыОчереди.Выполняется);
	Статусы.Добавить(Перечисления.кбп_СтатусыОчереди.Выполнено);
	Возврат Статусы;

КонецФункции

#КонецОбласти

#КонецОбласти
